In [84]:
print("hello world")

hello world

In [85]:
import pandas

In [86]:
import numpy

In [87]:
import os

In [88]:
import sklearn

In [89]:
path=os.path.join("Titanic","Titanic.csv")
data=pandas.read_csv(path)

In [90]:
data.shape

(891, 12)

In [91]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [92]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

# Business Understanding
#### Business Question
- penumpang seperti apa yang seharusnya memiliki peluang besar untuk selamat dalam kejadian tenggelamnya kapal titanic?
#### Hypothesis
- pihak kepolisian ingin mengetahui penumpang mana saja yang seharusnya mempunyai peluang besar untuk selamat dalam kejadian tenggelamnya kapal titanic berdasarkan data penumpang yang selamat dan meninggal, sehingga data ini dapat dipelajari oleh pihak dermaga untuk meminimalisir korban bencana tenggelamnya kapal dikemudian hari
#### Expected Output
- mengetahui penumpang seperti apa yang seharusnya memiliki peluang besar untuk selamat dalam kejadian tenggelamnya kapal titanic?
#### Experimentation Plan
- mengukur persentase data penumpang yang meninggal dan membandingkannya dengan data penumpang yang selamat

# Data Understanding
- PassengerId : Id dari records/penumpang
- Survived : Catatan bahwa dia selamat atau meninggal (1=Selamat, 0=Meninggal)
- Pclass : Kelas dari penumpang
- Name : Nama penumpang
- Sex : Jenis Kelamin penumpang
- Age : Usia penumpang
- SibSp : Jumlah Siblings/Spouse (saudara atau pasangan)
- Parch : Jumlah Parent/Childern (Orang tua atau anak)
- Ticket : Nomor Tiket
- Fare : Harga Tiket
- Cabin : Posisi duduk/kabin penumpang
- Embarked : Pelabuhan tempat penumpang berangkat

# Data Preparation

In [93]:
# check nilai-nilai unik pada semua kolom
data['Survived'].unique() # Survived

array([0, 1], dtype=int64)

In [94]:
data['Pclass'].unique() # Pclass

array([3, 1, 2], dtype=int64)

In [95]:
data['Sex'].unique() # Sex

array(['male', 'female'], dtype=object)

In [96]:
data['Embarked'].unique() # Embarked

array(['S', 'C', 'Q', nan], dtype=object)

In [97]:
# check jumlah data yang null
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [98]:
# check persentase data yang null
data.isna().mean()

PassengerId    0.000000
Survived       0.000000
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.198653
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000000
Cabin          0.771044
Embarked       0.002245
dtype: float64

In [99]:
# handling data null
data=data.drop(labels=['Cabin'],axis=1)

In [100]:
data['Age']=data['Age'].fillna(data['Age'].mean())

In [101]:
data['Embarked']=data['Embarked'].fillna(data['Embarked'].value_counts().idxmax())

In [102]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB

In [103]:
# handling data duplicate
data.loc[data['PassengerId'].duplicated()]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Embarked]
Index: []

In [104]:
data.loc[data['Name'].duplicated()]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Embarked]
Index: []

In [105]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB

In [106]:
# handling unneeded data
data=data.drop(labels=['Name'],axis=1)

In [107]:
data=data.drop(labels=['Ticket'],axis=1)

In [108]:
data=data.drop(labels=['Fare'],axis=1)

In [109]:
data=data.drop(labels=['Embarked'],axis=1)

In [110]:
data=data.drop(labels=['PassengerId'],axis=1)

In [132]:
data=data.drop(labels=['SibSp'],axis=1)

In [133]:
data=data.drop(labels=['Parch'],axis=1)

In [134]:
# find insight data
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       891 non-null    float64
dtypes: float64(1), int64(2), object(1)
memory usage: 28.0+ KB

In [168]:
# jumlah penumpang selamat dan meninggal berdasarkan Pclass
pandas.crosstab(data['Pclass'],data['Survived'])

Survived    0    1
Pclass
1          80  136
2          97   87
3         372  119

In [169]:
# jumlah penumpang selamat dan meninggal berdasarkan Sex
pandas.crosstab(data['Sex'],data['Survived'])

Survived    0    1
Sex
female     81  233
male      468  109

In [170]:
# jumlah penumpang selamat dan meninggal berdasarkan Age
pandas.crosstab(data['Age'],data['Survived'])

Survived  0  1
Age
0.42      0  1
0.67      0  1
0.75      0  2
0.83      0  2
0.92      0  1
...      .. ..
70.00     2  0
70.50     1  0
71.00     2  0
74.00     1  0
80.00     0  1

[89 rows x 2 columns]

In [171]:
# data manipulation
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       891 non-null    float64
dtypes: float64(1), int64(2), object(1)
memory usage: 28.0+ KB